In [5]:
import pandas as pd
# series
data=[1,2,3,4,5]
series=pd.Series(data)
print(series)

# series for dictionary
dict={"a":1,"b":2,"c":3}
dictSeries=pd.Series(dict)
print(dictSeries)

data1=[10,20,30,40,50]
index=["f","g","h","i","j"]
print(pd.Series(data1,index=index))

0    1
1    2
2    3
3    4
4    5
dtype: int64
a    1
b    2
c    3
dtype: int64
f    10
g    20
h    30
i    40
j    50
dtype: int64

In [6]:
# create a dataframe from a dictionary of list
data={
    "name":["aditya","krish","jack"],
    "age":[22,34,23],
    "city":["Mumbai","banglore","florida"]

}
df=pd.DataFrame(data)
print(df)

     name  age      city
0  aditya   22    Mumbai
1   krish   34  banglore
2    jack   23   florida

In [7]:
# create a dataframe from list of dictionary
data=[
    {"name":"aditya","age":22,"city":"Mumbai"},
    {"name":"krish","age":34,"city":"Florida"},
    {"name":"jack","age":22,"city":"Florida"},
]
df=pd.DataFrame(data)
print(df)

     name  age     city
0  aditya   22   Mumbai
1   krish   34  Florida
2    jack   22  Florida

In [4]:
import pandas as pd
df = pd.read_csv("Car_sales.csv")
print(df.head(5))   # first 5 entries
print(df.tail(5))   # last 5 entries

  Manufacturer    Model  Sales_in_thousands  __year_resale_value Vehicle_type  \
0        Acura  Integra              16.919               16.360    Passenger
1        Acura       TL              39.384               19.875    Passenger
2        Acura       CL              14.114               18.225    Passenger
3        Acura       RL               8.588               29.725    Passenger
4         Audi       A4              20.397               22.255    Passenger

   Price_in_thousands  Engine_size  Horsepower  Wheelbase  Width  Length  \
0               21.50          1.8       140.0      101.2   67.3   172.4
1               28.40          3.2       225.0      108.1   70.3   192.9
2                 NaN          3.2       225.0      106.9   70.6   192.0
3               42.00          3.5       210.0      114.6   71.4   196.6
4               23.99          1.8       150.0      102.6   68.2   178.0

   Curb_weight  Fuel_capacity  Fuel_efficiency Latest_Launch  \
0        2.639           13.2             28.0      2/2/2012
1        3.517           17.2             25.0      6/3/2011
2        3.470           17.2             26.0      1/4/2012
3        3.850           18.0             22.0     3/10/2011
4        2.998           16.4             27.0     10/8/2011

   Power_perf_factor
0          58.280150
1          91.370778
2                NaN
3          91.389779
4          62.777639
    Manufacturer Model  Sales_in_thousands  __year_resale_value Vehicle_type  \
152        Volvo   V40               3.545                  NaN    Passenger
153        Volvo   S70              15.245                  NaN    Passenger
154        Volvo   V70              17.531                  NaN    Passenger
155        Volvo   C70               3.493                  NaN    Passenger
156        Volvo   S80              18.969                  NaN    Passenger

     Price_in_thousands  Engine_size  Horsepower  Wheelbase  Width  Length  \
152                24.4          1.9       160.0      100.5   67.6   176.6
153                27.5          2.4       168.0      104.9   69.3   185.9
154                28.8          2.4       168.0      104.9   69.3   186.2
155                45.5          2.3       236.0      104.9   71.5   185.7
156                36.0          2.9       201.0      109.9   72.1   189.8

     Curb_weight  Fuel_capacity  Fuel_efficiency Latest_Launch  \
152        3.042           15.8             25.0     9/21/2011
153        3.208           17.9             25.0    11/24/2012
154        3.259           17.9             25.0     6/25/2011
155        3.601           18.5             23.0     4/26/2011
156        3.600           21.1             24.0    11/14/2011

     Power_perf_factor
152          66.498812
153          70.654495
154          71.155978
155         101.623357
156          85.735655

In [8]:
data=[
    {"name":"aditya","age":22,"city":"Mumbai"},
    {"name":"krish","age":34,"city":"Florida"},
    {"name":"jack","age":22,"city":"Florida"},
]
df=pd.DataFrame(data)
print(df.loc[0])    #0th row
print("\n")
print(df.iloc[0])   #oth column
print("\n")
print(df["name"])

name    aditya
age         22
city    Mumbai
Name: 0, dtype: object


name    aditya
age         22
city    Mumbai
Name: 0, dtype: object


0    aditya
1     krish
2      jack
Name: name, dtype: object

In [16]:
 # accesing a specified element
data=[
    {"name":"aditya","age":22,"city":"Mumbai"},
    {"name":"krish","age":34,"city":"banglore"},
    {"name":"jack","age":22,"city":"Florida"},
]
df=pd.DataFrame(data)
print(df)
print(df.at[2,"age"])
print(df.at[1,"name"])

# accesing using iat
print(df.iat[2,2]) # both row and column index are given

     name  age      city
0  aditya   22    Mumbai
1   krish   34  banglore
2    jack   22   Florida
22
krish
Florida

In [17]:
# data maniplulation with pandas
df

     name  age      city
0  aditya   22    Mumbai
1   krish   34  banglore
2    jack   22   Florida

In [19]:
# adding a new column
df["salary"]=[300,400,500]
df

     name  age      city  salary
0  aditya   22    Mumbai     300
1   krish   34  banglore     400
2    jack   22   Florida     500

In [22]:
# deleting a column
df.drop("salary",axis=1,inplace=True) # axis => by default it has row index, so it cannot find salary. inplace=> deletes permenantly, if no inplace param then it will delete temporariliy

KeyError: "['salary'] not found in axis"

In [23]:
print(df)

     name  age      city
0  aditya   22    Mumbai
1   krish   34  banglore
2    jack   22   Florida

In [24]:
# increment age of all
df["age"]=df["age"]+1
df

     name  age      city
0  aditya   23    Mumbai
1   krish   35  banglore
2    jack   23   Florida

In [27]:
# delete row
df.drop(0,inplace=True)

In [29]:
df.describe()

             age
count   2.000000
mean   29.000000
std     8.485281
min    23.000000
25%    26.000000
50%    29.000000
75%    32.000000
max    35.000000